<font color='red'>This LAB notebook will be considered for INDIVIDUAL evaluation </font> (remember that only the best 5 will be used for grade)!
<br><br>Rules:
 - You must register your presence (moodle QR code); <br>
 - The notebooks should be developed using JUPYTER\*; <br>
 - You are allowed to use Pyhton documentation and class resources (no ChatGPT, Co-Pilot, or other code "friend"!!); <br>
 - The notebook must be submitted with the cells already executed and with outputs visible. <br>
 - We should be able to run the notebook from start to finish without errors. <br>
 - You are only allowed to use the packages already imported on the notebook. You can, however, import specific functions from these packages.<br> 
    
\* If you decide to use other software and the notebook has any issue to run on JUPYTER it can't be evaluated

By the end of this class, your submission should contain a zipfile named *Studentnumber*_PDS_L04.zip to Moodle containing:

1. Your solved notebook named *Yourstudentnumber*_PDS_L04.ipynb

2. The data you imported

3. The data you exported

Please make sure that the notebook is fully run sequentially from start to end and that it gives no errors when running. Cells with errors should either be commented or deleted. Failing to meet this will result in a penalty.

#### GOOD LUCK!

In [1]:
import pandas as pd
import numpy as np

 **Exercise 1:** Import and Join data (5P) <br>
 If you notice you waste too much time on 1.1 and 1.2 you can uncomment the following cell that will provide you with the data to continue with the other exercises. <br> Logicially you won't get the points for the data you load in that way.

In [ ]:
# #Emergency load in
# salaries = pd.read_excel('import/salaries.xlsx', sheet_name='salaries_emergency', index_col='Name', dtype={'Salary': np.float64})
# people = pd.read_excel('import/salaries.xlsx', sheet_name='people_emergency', index_col='Name', dtype={'Age': np.float64})

**1.1** (1 P) Load the dataset people.csv in the variable people. You will have to specify some loading parameters and/or format the data after loading to make it look like the template shown in this markdown.<br>
Compare using the .head()-method and .shape-method, we expect the following: <br>
![alt text](people.jpg "Title")

In [2]:
#1.1
people_raw = pd.read_csv("import/people.csv", sep=";") # Read
people_raw = people_raw.iloc[1:] # Remove empty row by excluding it
people_raw = people_raw.set_index(people_raw["Name"]).drop(columns="Name") # Replace index

people = people_raw.copy()
# == ANSWER ==
print(people.shape)
display(people.head())

(21, 2)

       Gender   Age
Name
Miguel      M  30.0
Maria       F  20.0
Diego       M  40.0
Marco       M  60.0
Mateo       M  40.0

**1.2** (2 P) Load the dataset salaries.xlsx from the salaries sheet in the variable salaries. You will have to specify some loading parameters and/or format the data after loading to make it look like the template shown in this markdown.<br>
Compare using the .head()-method and .shape-method, we expect the following: <br>
![alt text](salaries.jpg "Title")

In [3]:
# 1.2
salaries_raw = pd.read_excel("import/salaries.xlsx", sheet_name="salaries") # Read file
salaries_raw = salaries_raw.iloc[:, 1:] # Remove first column (which is void)
salaries_raw.columns = salaries_raw.loc[0] # Set columns
salaries_raw = salaries_raw.iloc[7:, :] # Remove first 7 rows (which are void)
salaries_raw = salaries_raw.set_index(salaries_raw["Name"]).drop(columns="Name") # Replace index
salaries = salaries_raw.copy() # Make copy

# === ANSWER ===
print(salaries.shape)
display(salaries.head())

(22, 2)

0          Country Salary
Name
Miguel    Portugal  20000
Maria     Portugal  22000
Diego        Spain  30000
Marco        Italy  29000
Gabriela  Portugal  12000

**1.3** (1P) Which Name (index) is not appearing in the people but in the salaries dataset?

In [5]:
#1.3
for mu in salaries.index: 
    if mu not in people.index: # Loops in salaries, searches for missing in people
        print(f'\033[91m{mu}\033[0m', "does not exist in people but exists in salaries") # Prints answer with colors

Gabriela does not exist in people but exists in salaries

**1.4** (1P) Join the data in a way the we don't have this name included after joining in the varaible salaries_people.

In [7]:
#1.4
salaries_people = pd.merge(salaries, people, on="Name", how="inner") # Inner merge to remove elements s.t. x \not \in (A \cap B)
salaries_people.head() # display

try:
    salaries_people.loc["Gabriela"] 
except:
    print("OK")
else: # Testing to make sure Gabriela does not exist in our new data
    raise Exception("Error")

OK

**Exercise 2**: Manipulation (2P)

**2.1** (1P) Change the dtype of Age to an integer. Confirm the change checking the dtype of the first cell of Age after changing.

In [8]:
#2.1
salaries_people = salaries_people.astype({"Age": int})
salaries_people.iloc[0].Age.dtype # Verification

dtype('int32')

**2.2** (1P) Replace the values from the column Gender with 'Male' if the value is 'M' and 'Female' if the value is 'F'.
<br> Confirm by checking the unique values within this column after replacing.

In [9]:
#2.2
salaries_people.rename(
    mapper={"Male": "M", "Female": "F"},
    axis=1,
    inplace=True
)

salaries_people.Gender.unique() # Verification

array(['M', 'F'], dtype=object)

**Exercise 3**: Exploration (5P)

**3.1** (1P) What are the total value counts for the Gender?

In [10]:
#3.1
sigma = sum(salaries_people.Gender.value_counts())
print(sigma) # Total value counts for the gender

21

**3.2** (1P) Show the percentages of Males and Females.

In [11]:
#3.2
x = salaries_people.Gender.value_counts()

print(f"M: {x["M"]/sigma*100}%\nF: {x["F"]/sigma*100}%") # Prints answer

M: 52.38095238095239%
F: 47.61904761904761%

**3.3** (1P) What are the minimum and maximum values for the salary?

In [12]:
#3.3
print("Min:",salaries_people.Salary.min(),"| Max:", salaries_people.Salary.max()) # Prints answer

Min: 18000 | Max: 35000

**3.4** (1P) Show the mean and median values of the Salary grouped by the country.

In [24]:
#3.4
salaries_people.groupby(by="Country").agg(
    Mean = ("Salary", "mean"),
    Median = ("Salary", "median")
) # Returns DF

             Mean   Median
Country
France    26750.0  27500.0
Germany   30750.0  30500.0
Italy     30200.0  29000.0
Portugal  21500.0  21000.0
Spain     27250.0  27500.0

**3.5** (1P) Show the spearman correlation of Age and Salary.

In [15]:
#3.5
salaries_people.Salary = salaries_people.Salary.astype("int")
salaries_people.corr("spearman", numeric_only = True)

          Salary       Age
Salary  1.000000  0.643831
Age     0.643831  1.000000

**Exercise 4** Mixture (7 P)

**4.1** (1 P) Select the rows where the Name (index) is 'Miguel', 'Joao' or 'Hans.

In [16]:
#4.1
salaries_people.loc[["Miguel", "Joao", "Hans"]]

         Country  Salary Gender  Age
Name
Miguel  Portugal   20000      M   30
Joao    Portugal   26000      M   30
Hans     Germany   32000      M   40

**4.2** (1 P) Create a copy of salaries_people called salaries_people_c.

In [17]:
#4.2
salaries_people_c = salaries_people.copy() # Copies

**4.3** (1 P) Using salaries_people_c, keep only the rows in the dataframe where the Age is >= 30 and the Gender is Male, overwrite salaries_people_c with those values only.

In [18]:
#4.3
salaries_people_c = salaries_people_c.query("Age>=30")
salaries_people_c = salaries_people_c.query('Gender=="M"') # I could have used & but this works in the same way...
salaries_people_c

          Country  Salary Gender  Age
Name
Miguel   Portugal   20000      M   30
Diego       Spain   30000      M   40
Marco       Italy   29000      M   60
Mateo       Spain   23000      M   40
Julien     France   27000      M   30
Hans      Germany   32000      M   40
Joao     Portugal   26000      M   30
Luca        Italy   34000      M   40
Klaus     Germany   35000      M   50
Alessio     Italy   32000      M   40

**4.4** (1 P) Create a new column named 'Flag' with the value 1 for each row in salaries_people_c.

In [19]:
#4.4
salaries_people_c["Flag"]=1 # Set flag
salaries_people_c

          Country  Salary Gender  Age  Flag
Name
Miguel   Portugal   20000      M   30     1
Diego       Spain   30000      M   40     1
Marco       Italy   29000      M   60     1
Mateo       Spain   23000      M   40     1
Julien     France   27000      M   30     1
Hans      Germany   32000      M   40     1
Joao     Portugal   26000      M   30     1
Luca        Italy   34000      M   40     1
Klaus     Germany   35000      M   50     1
Alessio     Italy   32000      M   40     1

**4.5** (1 P) Join salaries_people with salaries_people_c, only using the 'Flag' column from slaries_people_c, in a way that we keep all rows from salaries_people.

In [20]:
#4.5

salaries_people = salaries_people.join(salaries_people_c["Flag"], on="Name", how="outer") # Joins on copy but only using flag, keeping every element
salaries_people

          Country  Salary Gender  Age  Flag
Name
Alessio     Italy   32000      M   40   1.0
Anna      Germany   29000      F   30   NaN
Aurora      Italy   29000      F   30   NaN
Camille    France   28000      F   30   NaN
Carmen      Spain   25000      F   30   NaN
Claire     France   29000      F   30   NaN
Daniela  Portugal   18000      F   20   NaN
Diego       Spain   30000      M   40   1.0
Eva       Germany   27000      F   40   NaN
Hans      Germany   32000      M   40   1.0
Joao     Portugal   26000      M   30   1.0
Julien     France   27000      M   30   1.0
Klaus     Germany   35000      M   50   1.0
Lea        France   23000      F   20   NaN
Luca        Italy   34000      M   40   1.0
Luigi       Italy   27000      M   20   NaN
Marco       Italy   29000      M   60   1.0
Maria    Portugal   22000      F   20   NaN
Mateo       Spain   23000      M   40   1.0
Miguel   Portugal   20000      M   30   1.0
Sofia       Spain   31000      F   30   NaN

**4.6** (1 P) Set the Flag column to 0 if it's missing.

In [21]:
# 4.6
salaries_people.Flag = salaries_people.Flag.fillna(0)
salaries_people = salaries_people.astype({"Flag": int})
salaries_people # Fills

          Country  Salary Gender  Age  Flag
Name
Alessio     Italy   32000      M   40     1
Anna      Germany   29000      F   30     0
Aurora      Italy   29000      F   30     0
Camille    France   28000      F   30     0
Carmen      Spain   25000      F   30     0
Claire     France   29000      F   30     0
Daniela  Portugal   18000      F   20     0
Diego       Spain   30000      M   40     1
Eva       Germany   27000      F   40     0
Hans      Germany   32000      M   40     1
Joao     Portugal   26000      M   30     1
Julien     France   27000      M   30     1
Klaus     Germany   35000      M   50     1
Lea        France   23000      F   20     0
Luca        Italy   34000      M   40     1
Luigi       Italy   27000      M   20     0
Marco       Italy   29000      M   60     1
Maria    Portugal   22000      F   20     0
Mateo       Spain   23000      M   40     1
Miguel   Portugal   20000      M   30     1
Sofia       Spain   31000      F   30     0

**4.7** (1 P) Create a Pivot Table with index = 'Flag', columns = 'Age', values = 'salary and aggfunc='mean' and save it in piv.

In [22]:
#4.7
piv = pd.pivot_table(
    data=salaries_people,
    index="Flag",
    columns="Age",
    values="Salary",
    aggfunc="mean"
) # Makes pivot
piv

Age        20            30       40       50       60
Flag
0     22500.0  28500.000000  27000.0      NaN      NaN
1         NaN  24333.333333  30200.0  35000.0  29000.0

**Exercise 5** Export and Submission(1 P)

**5.1** (1P) Write a for loop that saves the pivot table 4 times in the export folder, <br> each time using a different separator out of this list [',', ';', '-', '%'].

Hint: <br>
sep = '-' <br>
piv.to_csv(f'export/{sep}piv.csv',sep=sep) <br>
will lead to a file named '-piv.csv' using the '-' as a separator and put it in the export folder.

In [25]:
#5.1
seps = [',' , ';', '-', '%']
for my_sep in seps:
    piv.to_csv(f"export/{my_sep}piv.csv", sep=my_sep)

**5.2** (0 P as endresult if you don't) Submission <br>
Save this notebook as `Studentnumber_PDS_L04.ipynb`. Then create a zip file containing the jupyter notebook, and the accompanying folders with the data you imported and exported. Submit on Moodle.

$$
L_\mathbb C^p(T)
$$